# 4- Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

search = "qwe"
list_1 = ["qwe", "asd", "zxc", "qwe", "ertqwe", ]
try:
    list_1 = list(filter(lambda x: x, enumerate(list_1)))
    temp = [n[0] for n in list_1 if n[1] == search]
    print(f'ищем: {search}, ответ: {temp[1]}')
except IndexError:
    print(-1)