# 2-Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

# a = [2, 3, 4, 5, 6]
a = list(map(int, input('Введите числа списка через пробел: ').split()))

def proPair(a):
    print(a, end=' => ')
    i = 0
    j = 1
    c = []
    while i < len(a)/2:
        b = a[i] * a[-j]
        c.append(b)
        i += 1
        j += 1
    print(c)


proPair(a)
